blog/2018/07/29/vagrant使用指南/index.html
<!DOCTYPE html>
<html lang="en">
<head>
  <title>Vagrant使用指南 - 暗无天日</title>
  <meta charset="utf-8" />
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <meta name="viewport"
        content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no">
  <meta name="author" content="lujun9972" />
  <meta name="keywords" content="linux和它的小伙伴" />
  <link rel="stylesheet" media="screen" href="../../../../../media/css/font.css" rel="stylesheet" type="text/css"/>
  <link rel="stylesheet" href="../../../../../media/css/main.css" type="text/css">
  <link rel="stylesheet" href="../../../../../media/css/kdComment.css" type="text/css">
  <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/gitalk@1/dist/gitalk.css">
</head>

  <body class="container">
<div>
  <header class="masthead">
    <h1 class="masthead-title"><a href="../../../../../">暗无天日</a></h1>
    <p>=============&gt;随便,谢谢</p>
    <nav class="site-nav">
      <div class="menu-icon">
      </div>
      <ul class="trigger">
              <li><a href="../../../../../years/">Years</a></li>
              <li><a href="../../../../../authors/">Authors</a></li>
              <li><a href="../../../../../tags/">Tags</a></li>
              <li><a href="../../../../../about/">About</a></li>
              <li><a href="https://github.com/lujun9972/lujun9972.github.com.git">Github</a></li>
              <li><a href="../../../../../rss.xml">RSS</a></li>
      </ul>
    </nav>
    <form method="get" id="searchform" action="http://www.google.com/search">
        <input type="text" class="field" name="q" id="s" placeholder="Search">
        <input type="hidden" name="as_sitesearch" value="lujun9972.github.io">
    </form>
  </header>
</div>

<div>
<div class="post">
<h1 class="title">Vagrant使用指南</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgef4b7f0">Vagrant的依赖</a></li>
<li><a href="#org03cb028">创建第一台虚拟机</a>
<ul>
<li><a href="#orgd8fe9d0">创建VagrantFile</a></li>
<li><a href="#orgad97122">配置VagrangFile</a></li>
<li><a href="#orge89c8ef">Vagrant常用命令</a>
<ul>
<li><a href="#orgaa90f6d">启动虚拟机</a>
<ul>
<li><a href="#org17fe2e0">指定provider</a></li>
</ul>
</li>
<li><a href="#org4e44976">查看虚拟机状态</a></li>
<li><a href="#org954d3be">挂起虚拟机</a></li>
<li><a href="#orgdd07f06">重启虚拟机</a></li>
<li><a href="#org8e91813">关闭虚拟机</a></li>
<li><a href="#orgffbfb4a">删除虚拟机</a></li>
<li><a href="#orgfa27bfe">ssh登陆虚拟机</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org9b798e0">Vagrant provision</a></li>
<li><a href="#org7b62af8">管理box</a>
<ul>
<li><a href="#orgab3534f">添加box</a></li>
<li><a href="#org2177975">配置box</a></li>
<li><a href="#org1358c85">升级box</a></li>
<li><a href="#orgf996817">删除box</a></li>
</ul>
</li>
<li><a href="#org2f34675">关于同步目录(Synced Folders)</a></li>
<li><a href="#org5cf9ad3">网络配置</a>
<ul>
<li><a href="#org02ea9ff">端口转发</a></li>
<li><a href="#org192da5b">私有网络</a>
<ul>
<li><a href="#org09caf04">配置IP</a></li>
</ul>
</li>
<li><a href="#orgac82ecd">公有网络</a>
<ul>
<li><a href="#org8cc90c2">DHCP</a></li>
<li><a href="#orgea28956">设置静态IP</a></li>
<li><a href="#org88302b4">指定桥接的网卡</a></li>
</ul>
</li>
<li><a href="#orgdb5dd52">其他网络设置</a></li>
</ul>
</li>
<li><a href="#orgbf9036a">插件</a>
<ul>
<li><a href="#orgbbb749b">安装插件</a></li>
<li><a href="#org8553bdb">更新插件</a></li>
<li><a href="#org305407d">列出已安装的插件</a></li>
<li><a href="#orgc1ebb40">卸载插件</a></li>
</ul>
</li>
<li><a href="#orgaf50c8a">设置代理服务器</a>
<ul>
<li><a href="#org83bf98f">为 vagrant 命令设置代理</a></li>
<li><a href="#org1b1fae0">为虚拟机设置代理</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Vagrant是一款虚拟机管理工具，通过它可以以代码的方式快速地重建不同虚拟环境的虚拟机。
</p>

<p>
本文以virtualbox作为虚拟机引擎来演示一下Vagrant的使用方法。
</p>

<div id="outline-container-orgef4b7f0" class="outline-2">
<h2 id="orgef4b7f0">Vagrant的依赖</h2>
<div class="outline-text-2" id="text-orgef4b7f0">
<p>
Vagrant本身并不具有虚拟化的能力，因此它额外依赖于一套虚拟机程序,我们这里以VirtualBox作为例子，当然除了VirtualBox之外，Vagrant也支持Hyper-V和VMWare，甚至支持Docker作为虚拟机(虚拟环境)引擎。
我们一般把这些虚拟机引擎称之为provider.
</p>
<div class="org-src-container">
<pre class="src src-shell">sudo pacman -S virtualbox vagrant --noconfirm
</pre>
</div>

<p>
当然，要使虚拟机能够运行起来，除了有虚拟机引擎创建虚拟机之外，还需要有被虚拟的操作系统镜像，这些镜像我们称之为box。
box可以由自己创建或者直接使用他人分享的。
Vagrant有两类box，一类是“Pre-Build”，表示所有东西都已经安装在box中了，直接使用就好。
还有一类是“Base OS”，即只安装了一个基础的操作系统，其他所有的软件都需要自己来安装。
</p>
</div>
</div>


<div id="outline-container-org03cb028" class="outline-2">
<h2 id="org03cb028">创建第一台虚拟机</h2>
<div class="outline-text-2" id="text-org03cb028">
<p>
Vagrant通过一个名为 VagrangtFile 的配置文件来创建虚拟机,该文件中包含了如下信息：
</p>
<ul class="org-ul">
<li>使用哪个box作为虚拟镜像</li>
<li>使用哪个虚拟引擎进行虚拟化(virtualbox,vmware,hyper-v,docker等)</li>
<li>虚拟机的网络配置信息</li>
<li>其他虚拟机初始化脚本(shell,puppet,chef等)</li>
</ul>
</div>

<div id="outline-container-orgd8fe9d0" class="outline-3">
<h3 id="orgd8fe9d0">创建VagrantFile</h3>
<div class="outline-text-3" id="text-orgd8fe9d0">
<ol class="org-ol">
<li><p>
我们需要创建一个目录，用于存放VagrantFile
</p>
<div class="org-src-container">
<pre class="src src-shell">mkdir ~/rhel7
<span style="font-weight: bold;">cd</span> ~/rhel7
</pre>
</div></li>

<li><p>
运行 <code>vagrant init</code> 初始化Vagrant box。
</p>

<div class="org-src-container">
<pre class="src src-shell">vagrant init <span style="font-style: italic;">"generic/rhel7"</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-org">A `Vagrantfile` has been placed in this directory. You are now
ready to `vagrant up` your first virtual environment! Please read
the comments in the Vagrantfile as well as documentation on
`vagrantup.com` for more information on using Vagrant.
</pre>
</div>

<p>
该命令会初始化所在目录用于存放Vagrant相关信息(.vagrant目录)，并在其中中创建一个 <code>VagrantFile</code> 文件，并且在其中指明使用的box为 <code>centos/7</code>
</p>

<p>
Vagrant本身有一个云端预存了大量的box，你可以去 <a href="https://app.vagrantup.com/boxes/search">Vagrant Cloud</a> 搜索其他想要的box
</p></li>
</ol>
</div>
</div>

<div id="outline-container-orgad97122" class="outline-3">
<h3 id="orgad97122">配置VagrangFile</h3>
<div class="outline-text-3" id="text-orgad97122">
<p>
打开VagrantFile你会发现其中包含了关于虚拟机的大量设置，每个配置项还很贴心的包含了注释说明
</p>

<p>
其中比较常用的配置项有下面几个：
</p>

<ol class="org-ol">
<li><p>
<code>config.vm.box</code> 定义了使用哪个box启动虚拟机。若指定的box本机找不到，则会从 <a href="https://app.vagrantup.com/boxes/search">Vagrant Cloud</a> 中搜索并下载指定的box
</p>

<div class="org-src-container">
<pre class="src src-ruby">config.vm.box = <span style="font-style: italic;">"generic/rhel7"</span>
</pre>
</div></li>

<li><p>
<code>config.vm.hostname</code> 定义了虚拟机的主机名
</p>

<div class="org-src-container">
<pre class="src src-ruby">config.vm.hostname = <span style="font-style: italic;">"rhel7"</span>
</pre>
</div></li>

<li><p>
<code>config.vm.boot_timeout</code> 指明了系统启动的超时时间，若这段时间内Vagrang还无法连接上虚拟机，则认为虚拟机启动过程中发生了错误
</p>

<div class="org-src-container">
<pre class="src src-ruby">config.vm.boot_timeout = 600
</pre>
</div></li>

<li><p>
<code>config.vm.communicator</code> 指明了Vagrant与虚拟机通讯的方式，可以选择"ssh"或者"winrm",一般box为linux类操作系统则使用"ssh"，为windows操作系统则选择"winrm"
</p>

<div class="org-src-container">
<pre class="src src-ruby">config.vm.communicator = <span style="font-style: italic;">"ssh"</span>
</pre>
</div></li>

<li><p>
<code>config.vm.provider</code> 用于对虚拟机引擎进行配置
</p>

<div class="org-src-container">
<pre class="src src-ruby">config.vm.provider <span style="font-style: italic;">"virtualbox"</span> <span style="font-weight: bold;">do</span> |vb|
  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Display the VirtualBox GUI when booting the machine</span>
  vb.gui = <span style="font-weight: bold; text-decoration: underline;">true</span>

  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Customize the amount of memory on the VM:</span>
  vb.memory = <span style="font-style: italic;">"1024"</span>
  vb.cpus = 2
  vb.customize [<span style="font-style: italic;">"modifyvm"</span>, <span style="font-weight: bold; text-decoration: underline;">:id</span>, <span style="font-style: italic;">"--vram"</span>, <span style="font-style: italic;">"128"</span>]
  vb.customize [<span style="font-style: italic;">"modifyvm"</span>, <span style="font-weight: bold; text-decoration: underline;">:id</span>, <span style="font-style: italic;">"--clipboard"</span>, <span style="font-style: italic;">"bidirectional"</span>]
  vb.name = <span style="font-style: italic;">"RHEL7"</span>
<span style="font-weight: bold;">end</span>
</pre>
</div>

<p>
比如这段配置指明了虚拟机引擎为 "virtualbox"，启动虚拟机时会现实VirtualBox GUI。同时它还定义了该虚拟机拥有:
</p>

<ul class="org-ul">
<li>1G内存</li>

<li>2个CPU</li>

<li>128M显存</li>

<li>设置虚拟机与主机双向共享粘帖板</li>

<li>虚拟机的名称为RHEL7</li>
</ul></li>
</ol>
</div>
</div>


<div id="outline-container-orge89c8ef" class="outline-3">
<h3 id="orge89c8ef">Vagrant常用命令</h3>
<div class="outline-text-3" id="text-orge89c8ef">
</div>
<div id="outline-container-orgaa90f6d" class="outline-4">
<h4 id="orgaa90f6d">启动虚拟机</h4>
<div class="outline-text-4" id="text-orgaa90f6d">
<p>
配置好 <code>VagrantFile</code> 后，我们只需要在当前目录下运行 <code>vagrant up</code> 就能启动虚拟机了。
</p>
<div class="org-src-container">
<pre class="src src-shell">vagrant up
</pre>
</div>

<p>
若虚拟机尚未创建，则 <code>vagrant up</code> 会自动创建新虚拟机；同时若创建虚拟机时Vagrant发现指定的box不存在，则还会自动从 Vagrant Cloud 上搜索并下载指定的box
</p>

<p>
值得一提的时，由于在当前目录中存储了相关虚拟机的信息，因此在执行Vagrant命令时都无需指明作用于哪个虚拟机之上。
</p>
</div>
<div id="outline-container-org17fe2e0" class="outline-5">
<h5 id="org17fe2e0">指定provider</h5>
<div class="outline-text-5" id="text-org17fe2e0">
<p>
前面提到过Vagrant支持多种虚拟引擎来进行虚拟化，我们可以通过 <code>--provider</code> 参数来指定虚拟引擎，默认为 <code>virtualbox</code>
</p>

<p>
比如 <code>generic/arch</code> box有5种provider提供，分别时virtualbox,vmware_desktop,hyperv,libvirt,parallels. 
那么我们可以通过下面命令指定provider为libvirt
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#23433;&#35013;&#24517;&#35201;&#30340;&#20381;&#36182;</span>
sudo pacman -Syu ebtables dnsmasq
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">vagrant&#40664;&#35748;&#21482;&#25903;&#25345;VirtualBox&#65292;Hyper-V&#21644;Docker provider&#65292;&#38656;&#35201;&#23433;&#35013;&#25554;&#20214;&#26469;&#25903;&#25345;libvirt provider</span>
vagrant plugin install vagrant-libvirt
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#25351;&#23450;&#20351;&#29992;&#30340;box</span>
vagrant init generic/arch
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#25351;&#23450;&#21551;&#21160;&#30340;provider&#20026;libvirt</span>
vagrant up --provider libvirt
</pre>
</div>

<div class="org-src-container">
<pre class="src src-org">
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4e44976" class="outline-4">
<h4 id="org4e44976">查看虚拟机状态</h4>
<div class="outline-text-4" id="text-org4e44976">
<div class="org-src-container">
<pre class="src src-shell">vagrant status
</pre>
</div>
</div>
</div>

<div id="outline-container-org954d3be" class="outline-4">
<h4 id="org954d3be">挂起虚拟机</h4>
<div class="outline-text-4" id="text-org954d3be">
<div class="org-src-container">
<pre class="src src-shell">vagrant suspend
</pre>
</div>
</div>
</div>
