linux和它的小伙伴/Vagrant使用指南.org
*** 关闭虚拟机

#+BEGIN_SRC shell :dir ~/rhel7 :results org
  vagrant shutdown
#+END_SRC

*** 删除虚拟机

#+BEGIN_SRC shell :dir ~/rhel7 :results org
  vagrant destory
#+END_SRC

*** ssh登陆虚拟机

#+BEGIN_SRC shell :dir ~/rhel7 :results org
  vagrant ssh
#+END_SRC

* Vagrant provision
Vagrant provision能够让你为虚拟机自动安装软件并修改配置。

Vagrant会在三种情况下触发provision:
1. 第一次使用vagrant up创建虚拟环境,且没有指定 =--no-provision= 时
2. 运行命令 =vagrant provision= 时
3. 运行命令 =vagrant reload --provision= 时
   
Vagrant支持两种provision provider:
+ shell provider :: 调用shell或powershell脚本，脚本中应该不包括手工交互内容

  一个shell provision大概长得像这样
  #+BEGIN_SRC ruby
    config.vm.provision "shell", inline: <<-SHELL
      apt-get update
      apt-get install -y apache2
    SHELL
  #+END_SRC   
  
  其中 ="shell"= 表示使用的是shell provider, =inline:= 表示要执行的内容嵌入在后面， =<<-SHELL= 表示执行脚本到 =SHELL= 这一行结束。
  
  除了 =inline:= ,还可以是 =path:= 表示要执行的内容存放在后面指定的文件中。
  #+BEGIN_SRC ruby
    config.vm.provision :shell, path: "shell/main.cmd"
  #+END_SRC

+ file provider :: 将主机上的文件拷贝到虚拟机中但并不执行脚本的内容。

  一个shell provision大概长得像这样
  #+BEGIN_SRC ruby
    config.vm.provision "file",
                        source: "shell/RunBoxStarterGist.bat",
                        destination: "desktop\\RunBoxStarterGist.bat"
  #+END_SRC   
  
  很明显, =source:= 和 =destination:= 分别指明了源文件路径和目的文件路径

此外，值得说明的是，一个VagrantFile中支持多个 =config.vm.provision= 模块，Vagrant会从上到下一次执行。
* 管理box
** 添加box
box是用来创建虚拟机的基础镜像。当使用 =vagrant up= 启动虚拟机时，Vagrant会自动下载box，但你也可以使用下面命令手工添加一个box
#+BEGIN_SRC shell :results org
  vagrant box add ${name_or_url_or_path} [--name ${name}] [--box-version ${version}] [--provider ${provider}]
#+END_SRC

其中 ${name_or_url_or_path} 可以是box名称，或者指向box文件的URL或路径，
当 ${name_or_url_or_path} 是box名称时，Vagrant会在 [[https://app.vagrantup.com/boxes/search][Vagrant Cloud]] 中搜索指定名称的box，
当 ${name_or_url_or_path} 是指向box文件的URL或路径时，还必须跟 =--name ${name}= 连用以指定box名称。

同一个名字的box可能包含多个版本，这种情况下可以通过 =--box-version ${version}= 指定版本，
类似的，也可以通过 =--provider ${provider}= 来下载指定provider的box
** 配置box
添加box之后，我们可以在配置文件中使用它，关于box的配置是以 =config.vm.box= 开头的

像这样：
#+BEGIN_SRC ruby
  Vagrant.configure("2") do |config|
    config.vm.box = "hashicorp/precise64"
    config.vm.box_version = "1.1.0"
  end
#+END_SRC

或者是这样：
#+BEGIN_SRC ruby
  Vagrant.configure("2") do |config|
    config.vm.box = "hashicorp/precise64"
    config.vm.box_url = "http://files.vagrantup.com/precise64.box"
  end
#+END_SRC

注意， =config.vm.box= 并没有关于 =provider= 的配置，因为它是由 =config.vm.provider= 决定的
** 升级box
随着时间的推移，box可能也会发生改变，这是可以使用 =vagrant box update= 命令来对box进行升级。
#+BEGIN_SRC shell :results org :vars box="centos/7" 
  vagrant box update [--box ${name}] [--provider ${provider}]
#+END_SRC

默认情况下，vagrant会对当前目录所指定的box进行升级，但通过 =--box ${name}= 也可以指定升级特定的box, 通过 =--provider ${provider}= 则表示只更新特定 provider 的box
** 删除box
当不再使用某个box来创建虚拟机了，则可以将该box删除掉，以释放空间。
#+BEGIN_SRC shell :results org
  vagrant box remove ${name} [--provider ${provider}] [--box-version ${version}]
#+END_SRC
* 关于同步目录(Synced Folders)
Synced Folder可以用来实现宿主机和虚拟机之间共享文件，

默认情况下Vagrant会将你的项目目录(即包含Vagrangfile的那个目录)挂载到虚拟机的 =/vargrant= 目录。

可以在Vagrantfile中通过 =config.vm.synced_folder= 来添加Synced Folder
#+BEGIN_SRC ruby
  config.vm.synced_folder ${主机目录}, ${虚拟机目录}
#+END_SRC
其中主机目录若为相对路径，则是以Vagrant项目目录为基准
* 网络配置
Vagrnat中的所有关于网络的配置都是通过 =config.vm.network= 配置方法来进行的。
这个方法的第一个参数是一个字符串标识符，用来指明配置网络哪个方面的参数，比如 ="forwarded_port"= 就表示用来指明配置的是网络转发。
这个方法的其他参数则根据第一个参数的不同而不同。

在一个VagrantFile中，可以通过多次调用 =config.vm.network= 方法来多次配置网络参数。

** 端口转发
Vagrant的端口转发功能能够让你把发送到主机端口的数据包转发到虚拟机中去，从而实现暴露虚拟机服务的功能。

端口转发的标识符为 ="forwarded_port"=, 它有两个必须接受的参数 =host= 和 =guest=.
即发送到主机 =host= 端口上的数据包会被转发到 虚拟机的 =guest= 端口上。

比如
#+BEGIN_SRC ruby
  Vagrant.configure("2") do |config|
    config.vm.network "forwarded_port", guest: 80, host: 8080
  end
#+END_SRC
表示访问主机8080端口的数据包其实会被转发到虚拟机的80端口上去。

除了 =host= 和 =guest= 之外，其他常见的参数还包括:

+ guest_ip :: 指定转发到虚拟机的哪个IP上，默认会转发到虚拟机的每个IP接口上

+ host_ip :: 指定只有访问主机哪个IP上的端口才进行转发，默认也是主机的每个IP

+ protocol :: 指定转发的协议是 "tcp" 还是 "udp",默认是 "tcp"

** 私有网络
虚拟机与虚拟机之间、虚拟机与主机之间可以组成一个私有网络，这个网络只允许网络内的虚拟机或本地主机访问，而不允许主机外的机器进行访问。

私有网络的标识符为 ="private_network"=

*** 配置IP

配置IP有两种方式，一种是DHCP，一种是配置静态IP。最方便的方法莫过于直接通过DHCP动态分配IP了:
#+BEGIN_SRC ruby
  Vagrant.configure("2") do |config|
    config.vm.network "private_network", type: "dhcp"
  end
#+END_SRC

配置静态IP其实也挺简单的:
#+BEGIN_SRC ruby
  Vagrant.configure("2") do |config|
    config.vm.network "private_network", ip: "192.168.50.4"
  end
#+END_SRC

同时，静态IP还支持IPV6
#+BEGIN_SRC ruby
  Vagrant.configure("2") do |config|
    config.vm.network "private_network", ip: "fde4:8dba:82e1::c4"
  end
#+END_SRC


