blog/2018/07/29/vagrant使用指南/index.html

<div id="outline-container-orgdd07f06" class="outline-4">
<h4 id="orgdd07f06">重启虚拟机</h4>
<div class="outline-text-4" id="text-orgdd07f06">
<div class="org-src-container">
<pre class="src src-shell">vagrant reload
</pre>
</div>
</div>
</div>

<div id="outline-container-org8e91813" class="outline-4">
<h4 id="org8e91813">关闭虚拟机</h4>
<div class="outline-text-4" id="text-org8e91813">
<div class="org-src-container">
<pre class="src src-shell">vagrant shutdown
</pre>
</div>
</div>
</div>

<div id="outline-container-orgffbfb4a" class="outline-4">
<h4 id="orgffbfb4a">删除虚拟机</h4>
<div class="outline-text-4" id="text-orgffbfb4a">
<div class="org-src-container">
<pre class="src src-shell">vagrant destory
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfa27bfe" class="outline-4">
<h4 id="orgfa27bfe">ssh登陆虚拟机</h4>
<div class="outline-text-4" id="text-orgfa27bfe">
<div class="org-src-container">
<pre class="src src-shell">vagrant ssh
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org9b798e0" class="outline-2">
<h2 id="org9b798e0">Vagrant provision</h2>
<div class="outline-text-2" id="text-org9b798e0">
<p>
Vagrant provision能够让你为虚拟机自动安装软件并修改配置。
</p>

<p>
Vagrant会在三种情况下触发provision:
</p>
<ol class="org-ol">
<li>第一次使用vagrant up创建虚拟环境,且没有指定 <code>--no-provision</code> 时</li>
<li>运行命令 <code>vagrant provision</code> 时</li>
<li>运行命令 <code>vagrant reload --provision</code> 时</li>
</ol>

<p>
Vagrant支持两种provision provider:
</p>
<dl class="org-dl">
<dt>shell provider</dt><dd><p>
调用shell或powershell脚本，脚本中应该不包括手工交互内容
</p>

<p>
一个shell provision大概长得像这样
</p>
<div class="org-src-container">
<pre class="src src-ruby">config.vm.provision <span style="font-style: italic;">"shell"</span>, <span style="font-weight: bold; text-decoration: underline;">inline:</span> <span style="font-style: italic;">&lt;&lt;-SHELL</span>
<span style="font-style: italic;">  apt-get update</span>
<span style="font-style: italic;">  apt-get install -y apache2</span>
<span style="font-style: italic;">SHELL</span>
</pre>
</div>

<p>
其中 <code>"shell"</code> 表示使用的是shell provider, <code>inline:</code> 表示要执行的内容嵌入在后面， <code>&lt;&lt;-SHELL</code> 表示执行脚本到 <code>SHELL</code> 这一行结束。
</p>

<p>
除了 <code>inline:</code> ,还可以是 <code>path:</code> 表示要执行的内容存放在后面指定的文件中。
</p>
<div class="org-src-container">
<pre class="src src-ruby">config.vm.provision <span style="font-weight: bold; text-decoration: underline;">:shell</span>, <span style="font-weight: bold; text-decoration: underline;">path:</span> <span style="font-style: italic;">"shell/main.cmd"</span>
</pre>
</div></dd>

<dt>file provider</dt><dd><p>
将主机上的文件拷贝到虚拟机中但并不执行脚本的内容。
</p>

<p>
一个shell provision大概长得像这样
</p>
<div class="org-src-container">
<pre class="src src-ruby">config.vm.provision <span style="font-style: italic;">"file"</span>,
                    <span style="font-weight: bold; text-decoration: underline;">source:</span> <span style="font-style: italic;">"shell/RunBoxStarterGist.bat"</span>,
                    <span style="font-weight: bold; text-decoration: underline;">destination:</span> <span style="font-style: italic;">"desktop\\RunBoxStarterGist.bat"</span>
</pre>
</div>

<p>
很明显, <code>source:</code> 和 <code>destination:</code> 分别指明了源文件路径和目的文件路径
</p></dd>
</dl>

<p>
此外，值得说明的是，一个VagrantFile中支持多个 <code>config.vm.provision</code> 模块，Vagrant会从上到下一次执行。
</p>
</div>
</div>
<div id="outline-container-org7b62af8" class="outline-2">
<h2 id="org7b62af8">管理box</h2>
<div class="outline-text-2" id="text-org7b62af8">
</div>
<div id="outline-container-orgab3534f" class="outline-3">
<h3 id="orgab3534f">添加box</h3>
<div class="outline-text-3" id="text-orgab3534f">
<p>
box是用来创建虚拟机的基础镜像。当使用 <code>vagrant up</code> 启动虚拟机时，Vagrant会自动下载box，但你也可以使用下面命令手工添加一个box
</p>
<div class="org-src-container">
<pre class="src src-shell">vagrant box add ${<span style="font-weight: bold; font-style: italic;">name_or_url_or_path</span>} [--name ${<span style="font-weight: bold; font-style: italic;">name</span>}] [--box-version ${<span style="font-weight: bold; font-style: italic;">version</span>}] [--provider ${<span style="font-weight: bold; font-style: italic;">provider</span>}]
</pre>
</div>

<p>
其中 ${name_or_url_or_path} 可以是box名称，或者指向box文件的URL或路径，
当 ${name_or_url_or_path} 是box名称时，Vagrant会在 <a href="https://app.vagrantup.com/boxes/search">Vagrant Cloud</a> 中搜索指定名称的box，
当 ${name_or_url_or_path} 是指向box文件的URL或路径时，还必须跟 <code>--name ${name}</code> 连用以指定box名称。
</p>

<p>
同一个名字的box可能包含多个版本，这种情况下可以通过 <code>--box-version ${version}</code> 指定版本，
类似的，也可以通过 <code>--provider ${provider}</code> 来下载指定provider的box
</p>
</div>
</div>
<div id="outline-container-org2177975" class="outline-3">
<h3 id="org2177975">配置box</h3>
<div class="outline-text-3" id="text-org2177975">
<p>
添加box之后，我们可以在配置文件中使用它，关于box的配置是以 <code>config.vm.box</code> 开头的
</p>

<p>
像这样：
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="font-weight: bold; text-decoration: underline;">Vagrant</span>.configure(<span style="font-style: italic;">"2"</span>) <span style="font-weight: bold;">do</span> |config|
  config.vm.box = <span style="font-style: italic;">"hashicorp/precise64"</span>
  config.vm.box_version = <span style="font-style: italic;">"1.1.0"</span>
<span style="font-weight: bold;">end</span>
</pre>
</div>

<p>
或者是这样：
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="font-weight: bold; text-decoration: underline;">Vagrant</span>.configure(<span style="font-style: italic;">"2"</span>) <span style="font-weight: bold;">do</span> |config|
  config.vm.box = <span style="font-style: italic;">"hashicorp/precise64"</span>
  config.vm.box_url = <span style="font-style: italic;">"http://files.vagrantup.com/precise64.box"</span>
<span style="font-weight: bold;">end</span>
</pre>
</div>

<p>
注意， <code>config.vm.box</code> 并没有关于 <code>provider</code> 的配置，因为它是由 <code>config.vm.provider</code> 决定的
</p>
</div>
</div>
<div id="outline-container-org1358c85" class="outline-3">
<h3 id="org1358c85">升级box</h3>
<div class="outline-text-3" id="text-org1358c85">
<p>
随着时间的推移，box可能也会发生改变，这是可以使用 <code>vagrant box update</code> 命令来对box进行升级。
</p>
<div class="org-src-container">
<pre class="src src-shell">vagrant box update [--box ${<span style="font-weight: bold; font-style: italic;">name</span>}] [--provider ${<span style="font-weight: bold; font-style: italic;">provider</span>}]
</pre>
</div>

<p>
默认情况下，vagrant会对当前目录所指定的box进行升级，但通过 <code>--box ${name}</code> 也可以指定升级特定的box, 通过 <code>--provider ${provider}</code> 则表示只更新特定 provider 的box
</p>
</div>
</div>
<div id="outline-container-orgf996817" class="outline-3">
<h3 id="orgf996817">删除box</h3>
<div class="outline-text-3" id="text-orgf996817">
<p>
当不再使用某个box来创建虚拟机了，则可以将该box删除掉，以释放空间。
</p>
<div class="org-src-container">
<pre class="src src-shell">vagrant box remove ${<span style="font-weight: bold; font-style: italic;">name</span>} [--provider ${<span style="font-weight: bold; font-style: italic;">provider</span>}] [--box-version ${<span style="font-weight: bold; font-style: italic;">version</span>}]
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org2f34675" class="outline-2">
<h2 id="org2f34675">关于同步目录(Synced Folders)</h2>
<div class="outline-text-2" id="text-org2f34675">
<p>
Synced Folder可以用来实现宿主机和虚拟机之间共享文件，
</p>

<p>
默认情况下Vagrant会将你的项目目录(即包含Vagrangfile的那个目录)挂载到虚拟机的 <code>/vargrant</code> 目录。
</p>

<p>
可以在Vagrantfile中通过 <code>config.vm.synced_folder</code> 来添加Synced Folder
</p>
<div class="org-src-container">
<pre class="src src-ruby">config.vm.synced_folder ${&#20027;&#26426;&#30446;&#24405;}, ${&#34394;&#25311;&#26426;&#30446;&#24405;}
</pre>
</div>
<p>
其中主机目录若为相对路径，则是以Vagrant项目目录为基准
</p>
</div>
</div>
<div id="outline-container-org5cf9ad3" class="outline-2">
<h2 id="org5cf9ad3">网络配置</h2>
<div class="outline-text-2" id="text-org5cf9ad3">
<p>
Vagrnat中的所有关于网络的配置都是通过 <code>config.vm.network</code> 配置方法来进行的。
这个方法的第一个参数是一个字符串标识符，用来指明配置网络哪个方面的参数，比如 <code>"forwarded_port"</code> 就表示用来指明配置的是网络转发。
这个方法的其他参数则根据第一个参数的不同而不同。
</p>

<p>
在一个VagrantFile中，可以通过多次调用 <code>config.vm.network</code> 方法来多次配置网络参数。
</p>
</div>

<div id="outline-container-org02ea9ff" class="outline-3">
<h3 id="org02ea9ff">端口转发</h3>
<div class="outline-text-3" id="text-org02ea9ff">
<p>
Vagrant的端口转发功能能够让你把发送到主机端口的数据包转发到虚拟机中去，从而实现暴露虚拟机服务的功能。
</p>

<p>
端口转发的标识符为 <code>"forwarded_port"</code>, 它有两个必须接受的参数 <code>host</code> 和 <code>guest</code>.
即发送到主机 <code>host</code> 端口上的数据包会被转发到 虚拟机的 <code>guest</code> 端口上。
</p>

<p>
比如
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="font-weight: bold; text-decoration: underline;">Vagrant</span>.configure(<span style="font-style: italic;">"2"</span>) <span style="font-weight: bold;">do</span> |config|
  config.vm.network <span style="font-style: italic;">"forwarded_port"</span>, <span style="font-weight: bold; text-decoration: underline;">guest:</span> 80, <span style="font-weight: bold; text-decoration: underline;">host:</span> 8080
<span style="font-weight: bold;">end</span>
</pre>
</div>
<p>
表示访问主机8080端口的数据包其实会被转发到虚拟机的80端口上去。
</p>

<p>
除了 <code>host</code> 和 <code>guest</code> 之外，其他常见的参数还包括:
</p>

<dl class="org-dl">
<dt>guest_ip</dt><dd>指定转发到虚拟机的哪个IP上，默认会转发到虚拟机的每个IP接口上</dd>

<dt>host_ip</dt><dd>指定只有访问主机哪个IP上的端口才进行转发，默认也是主机的每个IP</dd>

<dt>protocol</dt><dd>指定转发的协议是 "tcp" 还是 "udp",默认是 "tcp"</dd>
</dl>
</div>
</div>

<div id="outline-container-org192da5b" class="outline-3">
<h3 id="org192da5b">私有网络</h3>
<div class="outline-text-3" id="text-org192da5b">
<p>
虚拟机与虚拟机之间、虚拟机与主机之间可以组成一个私有网络，这个网络只允许网络内的虚拟机或本地主机访问，而不允许主机外的机器进行访问。
</p>

<p>
私有网络的标识符为 <code>"private_network"</code>
</p>
</div>

<div id="outline-container-org09caf04" class="outline-4">
<h4 id="org09caf04">配置IP</h4>
<div class="outline-text-4" id="text-org09caf04">
<p>
配置IP有两种方式，一种是DHCP，一种是配置静态IP。最方便的方法莫过于直接通过DHCP动态分配IP了:
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="font-weight: bold; text-decoration: underline;">Vagrant</span>.configure(<span style="font-style: italic;">"2"</span>) <span style="font-weight: bold;">do</span> |config|
  config.vm.network <span style="font-style: italic;">"private_network"</span>, <span style="font-weight: bold; text-decoration: underline;">type:</span> <span style="font-style: italic;">"dhcp"</span>
<span style="font-weight: bold;">end</span>
</pre>
</div>

<p>
配置静态IP其实也挺简单的:
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="font-weight: bold; text-decoration: underline;">Vagrant</span>.configure(<span style="font-style: italic;">"2"</span>) <span style="font-weight: bold;">do</span> |config|
  config.vm.network <span style="font-style: italic;">"private_network"</span>, <span style="font-weight: bold; text-decoration: underline;">ip:</span> <span style="font-style: italic;">"192.168.50.4"</span>
<span style="font-weight: bold;">end</span>
</pre>
</div>

<p>
同时，静态IP还支持IPV6
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="font-weight: bold; text-decoration: underline;">Vagrant</span>.configure(<span style="font-style: italic;">"2"</span>) <span style="font-weight: bold;">do</span> |config|
  config.vm.network <span style="font-style: italic;">"private_network"</span>, <span style="font-weight: bold; text-decoration: underline;">ip:</span> <span style="font-style: italic;">"fde4:8dba:82e1::c4"</span>
<span style="font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
</div>
